simmsb/tyrfing/vendor/avr-device/svd/atmega128rfa1.svd
        <register>
          <name>CSMA_SEED_0</name>
          <description>Transceiver CSMA-CA Random Number Generator Seed Register</description>
          <addressOffset>0x31</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSMA_SEED_00</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSMA_SEED_01</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSMA_SEED_02</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSMA_SEED_03</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSMA_SEED_04</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSMA_SEED_05</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSMA_SEED_06</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSMA_SEED_07</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSMA_SEED_1</name>
          <description>Transceiver Acknowledgment Frame Control Register 2</description>
          <addressOffset>0x32</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CSMA_SEED_1</name>
              <description>Seed Value for CSMA Random Number Generator</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AACK_I_AM_COORD</name>
              <description>Set Personal Area Network Coordinator</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_DIS_ACK</name>
              <description>Disable Acknowledgment Frame Transmission</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_SET_PD</name>
              <description>Set Frame Pending Sub-field</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AACK_FVN_MODE</name>
              <description>Acknowledgment Frame Filter Mode</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACKNOWLEDGE_FRAMES_WITH_VERSION_NUMBER_0</name>
                  <description>Acknowledge frames with version number 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACKNOWLEDGE_FRAMES_WITH_VERSION_NUMBER_0_OR_1</name>
                  <description>Acknowledge frames with version number 0 or 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACKNOWLEDGE_FRAMES_WITH_VERSION_NUMBER_0_OR_1_OR_2</name>
                  <description>Acknowledge frames with version number 0 or 1 or 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACKNOWLEDGE_FRAMES_INDEPENDENT_OF_FRAME_VERSION_NUMBER</name>
                  <description>Acknowledge frames independent of frame version number</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FTN_CTRL</name>
          <description>Transceiver Filter Tuning Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FTN_START</name>
              <description>Start Calibration Loop of Filter Tuning Network</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_ADDR_0</name>
          <description>Transceiver MAC IEEE Address Register 0</description>
          <addressOffset>0x28</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEEE_ADDR_00</name>
              <description>MAC IEEE Address</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IEEE_ADDR_01</name>
              <description>MAC IEEE Address</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IEEE_ADDR_02</name>
              <description>MAC IEEE Address</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IEEE_ADDR_03</name>
              <description>MAC IEEE Address</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IEEE_ADDR_04</name>
              <description>MAC IEEE Address</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IEEE_ADDR_05</name>
              <description>MAC IEEE Address</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IEEE_ADDR_06</name>
              <description>MAC IEEE Address</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IEEE_ADDR_07</name>
              <description>MAC IEEE Address</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_ADDR_1</name>
          <description>Transceiver MAC IEEE Address Register 1</description>
          <addressOffset>0x29</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEEE_ADDR_</name>
              <description>MAC IEEE Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_ADDR_2</name>
          <description>Transceiver MAC IEEE Address Register 2</description>
          <addressOffset>0x2A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEEE_ADDR_</name>
              <description>MAC IEEE Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_ADDR_3</name>
          <description>Transceiver MAC IEEE Address Register 3</description>
          <addressOffset>0x2B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEEE_ADDR_</name>
              <description>MAC IEEE Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_ADDR_4</name>
          <description>Transceiver MAC IEEE Address Register 4</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEEE_ADDR_</name>
              <description>MAC IEEE Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_ADDR_5</name>
          <description>Transceiver MAC IEEE Address Register 5</description>
          <addressOffset>0x2D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEEE_ADDR_</name>
              <description>MAC IEEE Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_ADDR_6</name>
          <description>Transceiver MAC IEEE Address Register 6</description>
          <addressOffset>0x2E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEEE_ADDR_</name>
              <description>MAC IEEE Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_ADDR_7</name>
          <description>Transceiver MAC IEEE Address Register 7</description>
          <addressOffset>0x2F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IEEE_ADDR_</name>
              <description>MAC IEEE Address</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_MASK</name>
          <description>Transceiver Interrupt Enable Register</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLL_LOCK_EN</name>
              <description>PLL Lock Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_UNLOCK_EN</name>
              <description>PLL Unlock Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_START_EN</name>
              <description>RX_START Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_END_EN</name>
              <description>RX_END Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCA_ED_DONE_EN</name>
              <description>End of ED Measurement Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AMI_EN</name>
              <description>Address Match Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_END_EN</name>
              <description>TX_END Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AWAKE_EN</name>
              <description>Awake Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_STATUS</name>
          <description>Transceiver Interrupt Status Register</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLL_LOCK</name>
              <description>PLL Lock Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_UNLOCK</name>
              <description>PLL Unlock Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_START</name>
              <description>RX_START Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_END</name>
              <description>RX_END Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CCA_ED_DONE</name>
              <description>End of ED Measurement Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AMI</name>
              <description>Address Match Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_END</name>
              <description>TX_END Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AWAKE</name>
              <description>Awake Interrupt Status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAN_ID_0</name>
          <description>Device Identification Register (Manufacture ID Low Byte)</description>
          <addressOffset>0x22</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAN_ID_00</name>
              <description>Manufacturer ID (Low Byte)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAN_ID_01</name>
              <description>Manufacturer ID (Low Byte)</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAN_ID_02</name>
              <description>Manufacturer ID (Low Byte)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAN_ID_03</name>
              <description>Manufacturer ID (Low Byte)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAN_ID_04</name>
              <description>Manufacturer ID (Low Byte)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAN_ID_05</name>
              <description>Manufacturer ID (Low Byte)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAN_ID_06</name>
              <description>Manufacturer ID (Low Byte)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MAN_ID_07</name>
              <description>Manufacturer ID (Low Byte)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAN_ID_1</name>
          <description>Device Identification Register (Manufacture ID High Byte)</description>
          <addressOffset>0x23</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MAN_ID_</name>
              <description>Manufacturer ID (High Byte)</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ATMEL_BYTE_1</name>
                  <description>Atmel JEDEC manufacturer ID, bits [15:8] of 32 bit manufacturer ID: 00 00 00 1F</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PAN_ID_0</name>
          <description>Transceiver Personal Area Network ID Register (Low Byte)</description>
          <addressOffset>0x26</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PAN_ID_00</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAN_ID_01</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAN_ID_02</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAN_ID_03</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAN_ID_04</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAN_ID_05</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAN_ID_06</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAN_ID_07</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAN_ID_1</name>
          <description>Transceiver Personal Area Network ID Register (High Byte)</description>
          <addressOffset>0x27</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PAN_ID_</name>
              <description>MAC Personal Area Network ID</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
